&НаСервере
Процедура ЗаполнитьТаблицы()
	
	СтруктураБазы = ПолучитьИзВременногоХранилища(АдресСтруктурыБазы);
	
	Если СтруктураБазы = Неопределено Тогда
		
		СтруктураБазы = ПолучитьСтруктуруХраненияБазыДанных();
		ПоместитьВоВременноеХранилище(СтруктураБазы, АдресСтруктурыБазы);
		
	КонецЕсли;
	
	Результат.Очистить();
	Поля.Очистить();
	Индексы.Очистить();
	ПоляИндексов.Очистить();
	
	Для Каждого ТекСтрока Из СтруктураБазы Цикл
		ЗаполнитьЗначенияСвойств(Результат.Добавить(), ТекСтрока);	
		ПоляИзСтруктуры = ТекСтрока.Поля;
		Для Каждого ТекСтрокаПоля Из ПоляИзСтруктуры Цикл
			НоваяСтрока = Поля.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаПоля);
			НоваяСтрока.ИмяТаблицы = ТекСтрока.ИмяТаблицыХранения;
		КонецЦикла; 
		
		ИндексыИзСтруктуры = ТекСтрока.Индексы;
		Для Каждого ТекСтрокаИндексы Из ИндексыИзСтруктуры Цикл
			НоваяСтрока = Индексы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаИндексы);
			НоваяСтрока.ИмяТаблицы = ТекСтрока.ИмяТаблицыХранения;
			
			ПоляИндексовИзСтруктуры = ТекСтрокаИндексы.Поля;
			Для Каждого ТекСтрокаПоляИндексов Из ПоляИндексовИзСтруктуры Цикл
				НоваяСтрока = ПоляИндексов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаПоляИндексов);
				НоваяСтрока.ИмяИндексаХранения = ТекСтрокаИндексы.ИмяИндексаХранения;
				НоваяСтрока.ИмяТаблицы = ТекСтрока.ИмяТаблицыХранения;
			КонецЦикла; 
			
		КонецЦикла; 	
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура НайтиПоИмениТаблицыХранения()
	
	СтруктураБазы = ПолучитьИзВременногоХранилища(АдресСтруктурыБазы);
	
	ИмяДляПоиска = ВРЕГ(СокрЛП(ИмяТаблицыХранения));
	Если Лев(ИмяДляПоиска, 1) = "_" Тогда
		ИмяДляПоиска = Сред(ИмяДляПоиска, 2);
	КонецЕсли;
	НайденныеСтроки = Новый Массив();
	Для каждого Строка из СтруктураБазы Цикл
		Если Найти(ВРЕГ(Строка.ИмяТаблицыХранения), ИмяДляПоиска) > 0 
			ИЛИ Найти(ВРЕГ(Строка.ИмяТаблицы), ИмяДляПоиска)
			ИЛИ Найти(ВРЕГ(Строка.Метаданные), ИмяДляПоиска)
			ИЛИ Найти(ВРЕГ(Строка.Назначение), ИмяДляПоиска) Тогда
			НайденныеСтроки.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Результат.Очистить();			
	Для каждого Строка из НайденныеСтроки Цикл
		ЗаполнитьЗначенияСвойств(Результат.Добавить(), Строка);
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура УстановитьОтбор(Команда)
	НайтиПоИмениТаблицыХранения();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресСтруктурыБазы = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ЗаполнитьТаблицы();
	
КонецПроцедуры
 
&НаКлиенте
Процедура РезультатПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.Результат.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ОтборСтрок = Новый ФиксированнаяСтруктура("ИмяТаблицы", ТекДанные.ИмяТаблицыХранения);
	
	Элементы.Поля.ОтборСтрок = ОтборСтрок;
	Элементы.Индексы.ОтборСтрок = ОтборСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексыПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.Индексы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	ОтборСтрок = Новый ФиксированнаяСтруктура("ИмяИндексаХранения, ИмяТаблицы", ТекДанные.ИмяИндексаХранения, ТекДанные.ИмяТаблицы);
	
	Элементы.ПоляИндексов.ОтборСтрок = ОтборСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяТаблицыХраненияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИмяТаблицыХранения = Текст;
	
	Если ПустаяСтрока(ИмяТаблицыХранения) Тогда
		
		ЗаполнитьТаблицы();
		
	Иначе
		
		НайтиПоИмениТаблицыХранения();		
		
	КонецЕсли;
		
КонецПроцедуры
