&НаСервере
Процедура ПолучитьСтруктуру()
	
	СтруктураБазы = ПолучитьИзВременногоХранилища(АдресСтруктурыБазы);
	
	Если СтруктураБазы = Неопределено Тогда
		
		СтруктураБазы = ПолучитьСтруктуруХраненияБазыДанных();
		ПоместитьВоВременноеХранилище(СтруктураБазы, АдресСтруктурыБазы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НайтиПоИмениТаблицыХранения()
		
	Результат.Очистить();	
	
	СтруктураБазы = ПолучитьИзВременногоХранилища(АдресСтруктурыБазы);
	
	ИмяДляПоиска = ВРЕГ(СокрЛП(ИмяТаблицыХранения));
	Если Не ТочноеСоответствие И Лев(ИмяДляПоиска, 1) = "_" Тогда
		ИмяДляПоиска = Сред(ИмяДляПоиска, 2);
	КонецЕсли;
	НайденныеСтроки = Новый Массив();
	
	Если ПустаяСтрока(ИмяДляПоиска) Тогда
		Возврат;
	КонецЕсли;
	
	Если IsRussianScript() Тогда
		Для каждого Строка из СтруктураБазы Цикл
			
			Если ВключаяПоля Тогда					
				Для каждого СтрокаПоле Из Строка.Поля Цикл					
					Если ТочноеСоответствие Тогда
						Если ВРЕГ(СтрокаПоле.ИмяПоляХранения) = ИмяДляПоиска 
							ИЛИ ВРЕГ(СтрокаПоле.ИмяПоля) = ИмяДляПоиска Тогда
							НайденныеСтроки.Добавить(Строка);
						КонецЕсли;											
					Иначе
						
						Если Найти(ВРЕГ(СтрокаПоле.ИмяПоляХранения), ИмяДляПоиска) > 0 
							ИЛИ Найти(ВРЕГ(СтрокаПоле.ИмяПоля), ИмяДляПоиска) Тогда
							НайденныеСтроки.Добавить(Строка);
						КонецЕсли;	
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;		
			
			Если ТочноеСоответствие Тогда
				Если ВРЕГ(Строка.ИмяТаблицыХранения) = ИмяДляПоиска
					ИЛИ ВРЕГ(Строка.ИмяТаблицы) = ИмяДляПоиска
					ИЛИ ВРЕГ(Строка.Метаданные) = ИмяДляПоиска
					ИЛИ ВРЕГ(Строка.Назначение) = ИмяДляПоиска Тогда
					НайденныеСтроки.Добавить(Строка);
				КонецЕсли;				
			Иначе
				Если Найти(ВРЕГ(Строка.ИмяТаблицыХранения), ИмяДляПоиска) > 0 
					ИЛИ Найти(ВРЕГ(Строка.ИмяТаблицы), ИмяДляПоиска)
					ИЛИ Найти(ВРЕГ(Строка.Метаданные), ИмяДляПоиска)
					ИЛИ Найти(ВРЕГ(Строка.Назначение), ИмяДляПоиска) Тогда
					НайденныеСтроки.Добавить(Строка);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого Строка из НайденныеСтроки Цикл
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.ИмяТаблицы = Строка.ИмяТаблицы;
			НоваяСтрока.Метаданные = Строка.Метаданные;
			НоваяСтрока.Назначение = Строка.Назначение;
			НоваяСтрока.ИмяТаблицыХранения = Строка.ИмяТаблицыХранения;
			
			Для каждого Поле ИЗ Строка.Поля Цикл
				 НоваяСтрокаПолей = НоваяСтрока.Поля.Добавить();
				 НоваяСтрокаПолей.ИмяПоляХранения = Поле.ИмяПоляХранения;
				 НоваяСтрокаПолей.ИмяПоля = Поле.ИмяПоля;
				 НоваяСтрокаПолей.Метаданные = Поле.Метаданные;
			 КонецЦикла;
			 
			 Для каждого Индекс ИЗ Строка.Индексы Цикл
				 НоваяСтрокаИндексов = НоваяСтрока.Индексы.Добавить();
				 НоваяСтрокаИндексов.ИмяИндексаХранения = Индекс.ИмяИндексаХранения;
				 
				 // Поля индекса
				 Для каждого Поле ИЗ Индекс.Поля Цикл
					 НоваяСтрокаПолейИндекса = НоваяСтрокаИндексов.ПоляИндекса.Добавить();
					 НоваяСтрокаПолейИндекса.ИмяПоляХранения = Поле.ИмяПоляХранения;
					 НоваяСтрокаПолейИндекса.ИмяПоля = Поле.ИмяПоля;
					 НоваяСтрокаПолейИндекса.Метаданные = Поле.Метаданные;
				 КонецЦикла;
				 
			 КонецЦикла;
			
		КонецЦикла;
		
	Иначе
		Для каждого Строка из СтруктураБазы Цикл
			
			Если ВключаяПоля Тогда				
				Для каждого СтрокаПоле Из Строка.Fields Цикл
					Если ТочноеСоответствие Тогда
						Если ВРЕГ(СтрокаПоле.StorageFieldName) = ИмяДляПоиска 
							ИЛИ ВРЕГ(СтрокаПоле.FieldName) = ИмяДляПоиска Тогда
							НайденныеСтроки.Добавить(Строка);
						КонецЕсли;											
					Иначе
						Если Найти(ВРЕГ(СтрокаПоле.StorageFieldName), ИмяДляПоиска) > 0 
							ИЛИ Найти(ВРЕГ(СтрокаПоле.FieldName), ИмяДляПоиска) Тогда
							НайденныеСтроки.Добавить(Строка);
						КонецЕсли;					
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ТочноеСоответствие Тогда
				Если ВРЕГ(Строка.StorageTableName) = ИмяДляПоиска
					ИЛИ ВРЕГ(Строка.TableName) = ИмяДляПоиска
					ИЛИ ВРЕГ(Строка.Metadata) = ИмяДляПоиска
					ИЛИ ВРЕГ(Строка.Purpose) = ИмяДляПоиска Тогда
					НайденныеСтроки.Добавить(Строка);
				КонецЕсли;								
			Иначе
				Если Найти(ВРЕГ(Строка.StorageTableName), ИмяДляПоиска) > 0 
					ИЛИ Найти(ВРЕГ(Строка.TableName), ИмяДляПоиска)
					ИЛИ Найти(ВРЕГ(Строка.Metadata), ИмяДляПоиска)
					ИЛИ Найти(ВРЕГ(Строка.Purpose), ИмяДляПоиска) Тогда
					НайденныеСтроки.Добавить(Строка);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
		
		Для каждого Строка из НайденныеСтроки Цикл
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.ИмяТаблицы = Строка.TableName;
			НоваяСтрока.Метаданные = Строка.Metadata;
			НоваяСтрока.Назначение = Строка.Purpose;
			НоваяСтрока.ИмяТаблицыХранения = Строка.StorageTableName;
			
			Для каждого Поле ИЗ Строка.Fields Цикл
				 НоваяСтрокаПолей = НоваяСтрока.Поля.Добавить();
				 НоваяСтрокаПолей.ИмяПоляХранения = Поле.StorageFieldName;
				 НоваяСтрокаПолей.ИмяПоля = Поле.FieldName;
				 НоваяСтрокаПолей.Метаданные = Поле.Metadata;
			 КонецЦикла;
			 
			 Для каждого Индекс ИЗ Строка.Indexes Цикл
				 НоваяСтрокаИндексов = НоваяСтрока.Индексы.Добавить();
				 НоваяСтрокаИндексов.ИмяИндексаХранения = Индекс.StorageIndexName;
				 
				 // Поля индекса
				 Для каждого Поле ИЗ Индекс.Fields Цикл
					 НоваяСтрокаПолейИндекса = НоваяСтрокаИндексов.ПоляИндекса.Добавить();
					 НоваяСтрокаПолейИндекса.ИмяПоляХранения = Поле.StorageFieldName;
					 НоваяСтрокаПолейИндекса.ИмяПоля = Поле.FieldName;
					 НоваяСтрокаПолейИндекса.Метаданные = Поле.Metadata;
				 КонецЦикла;
				 
			 КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтбор(Команда)
	
	НайтиПоИмениТаблицыХранения();		

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресСтруктурыБазы = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ПолучитьСтруктуру();
	
КонецПроцедуры
 
&НаКлиенте
Процедура РезультатПриАктивизацииСтроки(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексыПриАктивизацииСтроки(Элемент)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяТаблицыХраненияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ДанныеВыбора = Новый СписокЗначений();
	ДанныеВыбора.Добавить(Текст);
	СтандартнаяОбработка = Ложь;
	ИмяТаблицыХранения = Текст;	
	НайтиПоИмениТаблицыХранения();		
		
КонецПроцедуры

&НаСервере
Процедура LoadFromTXTFile(Параметры, АдресДляСообщений = Неопределено) Экспорт
	
	СтруктураБазы = ПолучитьИзВременногоХранилища(АдресСтруктурыБазы);
	
	Если СтруктураБазы = Неопределено Тогда
		
		СтруктураБазы = ПолучитьСтруктуруХраненияБазыДанных();
		ПоместитьВоВременноеХранилище(СтруктураБазы, АдресСтруктурыБазы);
		
	КонецЕсли;
	
КонецПроцедуры

Function IsRussianScript()
	Return String(Metadata.ScriptVariant) = "Русский";		
EndFunction 

 
